<template>
  <div class="container mx-auto mt-24">
    <section class="bg-white m-10 p-10 rounded-lg">
      <div class="my-5">
        <h1 class="text-3xl font-bold mb-3 text-center">利用規約</h1>
        <p class="ml-4">
          この利用規約(以下、「本規約」といいます。)は、本サービス(本サイトを含むものとし、以下、特に両者を区別しません。)の利用条件を定めるものです。本規約は、本サービスを利用するすべてのユーザーに適用されます。
        </p>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第1条（本規約への同意）</h2>
        <p class="mb-2 ml-4">
          ユーザーは、本サービスを利用することによって、本規約に有効かつ取り消し不能な同意をしたものとみなされます。<br />本規約に同意しないユーザーは、本サービスをご利用いただけません。
        </p>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第2条（第利用登録）</h2>
        <p class="mb-2 ml-4">
          本サービスの利用を希望する方は、本規約に同意の上、当局の定める方法によって利用登録を申請し、当局がこれを承認することによって、本サービスの利用登録をすることができます。
        </p>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第3条（第登録拒否）</h2>
        <p class="mb-2 ml-4">
          当局は、以下のいずれかの事由があると判断した場合、利用登録の申請を承認しないことがあります。当局は登録拒否の理由について一切の開示義務を負いません。
        </p>
        <ul class="ml-4 p-4 list-decimal">
          <li>虚偽の事項を届け出た場合</li>
          <li>本規約に違反したことがある者からの申請である場合</li>
          <li>その他、当局が利用登録を相当でないと判断した場合</li>
        </ul>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第4条（第条未成年による利用）</h2>
        <p class="mb-2 ml-4">
          ユーザーが未成年である場合には、法定代理人の同意を得た上で、本サービスを利用してください。
          法定代理人の同意を得ずに本サービスのご利用を開始したユーザーが成年に達した場合、未成年者であった間の利用行為を追認したものとみなします。
        </p>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第5条（ログイン情報の管理）</h2>
        <p class="mb-2 ml-4">
          ユーザーは、自己の責任において、本サービスのログイン情報を適切に管理するものとします。ユーザーは、いかなる場合にも、ログイン情報を第三者に譲渡または貸与し、もしくは第三者と共用することはできません。当局は、ログイン情報が第三者によって使用されたことによって生じた損害につき、当局に故意又は重大な過失がある場合を除き、一切の責任を負いません。
        </p>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第6条（コンテンツのご利用）</h2>
        <p class="mb-2 ml-4">
          当局は、ユーザーに対し、本サービスが提供する文章、画像、動画、音声、音楽、ソフトウェア、プログラム、コードその他のコンテンツについて、本サービスの利用範囲内における私的な利用を許諾します。
          <br />
          理由の如何を問わず、ユーザーが本サービスを利用する権利を失った場合、本サービスの一切のコンテンツの利用ができなくなることを、ユーザーは予め承諾するものとします。
        </p>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第7条（禁止事項）</h2>
        <p class="mb-2 ml-4">
          ユーザーは、本サービスの利用にあたり、以下の行為をしてはなりません。
        </p>
        <ul class="ml-4 p-4 list-decimal">
          <li>
            法令、裁判所の判決、決定若しくは命令、又は法令上拘束力のある行政措置に違反する行為又はこれらを助長する行為
          </li>
          <li>犯罪行為に関連する行為</li>
          <li>当局や第三者の知的財産権を侵害する行為</li>
          <li>
            当局や第三者の肖像権、プライバシー、名誉、その他の権利又は利益を侵害する行為
          </li>
          <li>
            当局や第三者のサーバーまたはネットワークに過度の負担をかけたり、その正常な作動を妨害する行為
          </li>
          <li>当局のサービスの運営を妨害するおそれのある行為</li>
          <li>不正アクセスをし、またはこれを試みる行為</li>
          <li>
            逆アセンブル、逆コンパイル、リバースエンジニアリング等によって本サービスのソースコードを解析する行為
          </li>
          <li>
            本サービスに接続しているシステムに権限なく不正にアクセスし又は当局設備に蓄積された情報を不正に書き換え若しくは消去する行為
          </li>
          <li>
            本サービスのウェブサイトやソフトウェアを複製、送信、譲渡、貸与又は改変する行為
          </li>
          <li>
            本サービス上のアカウント又はコンテンツを第三者に有償で貸与、譲渡、売買等をする行為
          </li>
          <li>本サービスによって得られた情報を商業的に利用する行為</li>
          <li>
            当局が意図しない方法によって本サービスに関連して利益を得ることを目的とする行為
          </li>
          <li>
            当局が許諾しない本サービス上での宣伝、広告、勧誘、または営業行為
          </li>
          <li>他のユーザーに関する個人情報等を収集または蓄積する行為</li>
          <li>違法、不正又は不当な目的を持って本サービスを利用する行為</li>

          <li>
            営業、宣伝、広告、勧誘、その他営利を目的とする行為（管理者の認めたものを除きます。）
          </li>
          <li>
            本サービスの他のユーザーまたはその他の第三者に不利益、損害、不快感を与える行為
          </li>
          <li>他のユーザーに成りすます行為</li>
          <li>他のユーザーのアカウントを利用する行為</li>
          <li>反社会的勢力に対して直接または間接に利益を供与する行為</li>
          <li>公序良俗に違反する行為</li>
          <li>
            歩行中、車両運転中、その他本サービスの利用が不適切な状況又は態様において本サービスを利用する行為
          </li>
          <li>その他、当局が不適切と判断する行為</li>
        </ul>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第8条（反社会的勢力の排除）</h2>
        <p class="mb-2 ml-4">
          ユーザーは、次の各号のいずれか一にも該当しないことを表明し、かつ将来にわたっても該当しないことを表明し、保証するものとします。
        </p>
        <ul class="ml-4 p-4 list-decimal">
          <li>
            ユーザーは、次の各号のいずれか一にも該当しないことを表明し、かつ将来にわたっても該当しないことを表明し、保証するものとします。
          </li>
          <li>
            自ら（法人その他の団体にあっては、自らの役員を含みます。）が、暴力団、暴力団員、暴力団員でなくなった時から5年を経過しない者、暴力団準構成員、暴力団関係企業、総会屋、社会運動等標ぼうゴロまたは特殊知能暴力集団等その他これらに準じる者（以下総称して「暴力団員等」といいます。）であること
          </li>
          <li>
            ユーザーが法人その他の団体の場合にあっては、暴力団員等が経営を支配していると認められる関係を有すること
          </li>
          <li>
            自らもしくは第三者の不正の利益を図る目的または第三者に損害を加える目的をもって取引を行うなど、暴力団員等を利用していると認められる関係を有すること
          </li>
          <li>
            暴力団員等に対して資金等を提供し、または便宜を供与するなどの関与をしていると認められる関係を有すること
          </li>
          <li>
            ユーザーが法人その他の団体の場合にあっては、自らの役員または自らの経営に実質的に関与している者が暴力団員等と社会的に非難されるべき関係を有すること
          </li>
        </ul>
        <p class="mb-2 ml-4">
          ユーザーは、自らまたは第三者を利用して次の各号のいずれか一にでも該当する行為を行わないことを保証するものとします。
        </p>
        <ul class="ml-4 p-4 list-decimal">
          <li>暴力的な要求行為</li>
          <li>法的な責任を超えた不当な要求行為</li>
          <li>取引に関して、脅迫的な言動をし、または暴力を用いる行為</li>
          <li>
            風説を流布し、偽計を用い、または威力を用いて、当局の信用を毀損し、または当局の業務を妨害する行為
          </li>
          <li>その他前各号に準ずる行為</li>
        </ul>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第9条（利用制限）</h2>
        <p class="mb-2 ml-4">
          当局は、ユーザーが以下のいずれかに該当する場合には、事前の通知なく、ユーザーに対して、本サービスの全部もしくは一部の利用を制限し、またはユーザーとしての登録を抹消することができるものとします。当局は、本条に基づき当局が行った行為によりユーザーに生じた損害について、一切の責任を負いません。
        </p>
        <ul class="ml-4 p-4 list-decimal">
          <li>本規約のいずれかの条項に違反した場合</li>
          <li>登録事項に虚偽の事実があることが判明した場合</li>
          <li>
            前項本文の定めるものを除き、本サービスおよび本サービスに関連する一切の情報についての著作権およびその他の知的財産権はすべて管理者または管理者にその利用を許諾した権利者に帰属し、ユーザーは無断で複製、譲渡、貸与、翻訳、改変、転載、公衆送信（送信可能化を含みます。）、伝送、配布、出版、営業使用等をしてはならないものとします。
          </li>
        </ul>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第10条（本サービスの提供の停止）</h2>
        <p class="mb-2 ml-4">
          当局は、以下のいずれかの事由があると判断した場合、ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。当局は、この場合にユーザーまたは第三者が被ったいかなる不利益または損害についても、一切の責任を負わないものとします。
        </p>
        <ul class="ml-4 p-4 list-decimal">
          <li>
            本サービスにかかるコンピュータシステムの保守点検または更新を行う場合
          </li>
          <li>
            地震、落雷、火災、停電、天災またはウィルスの蔓延などの不可抗力により、本サービスの提供が困難となった場合
          </li>
          <li>コンピュータまたは通信回線等が事故により停止した場合</li>
          <li>その他、当局が本サービスの提供が困難と判断した場合</li>
        </ul>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第11条（保証の否認）</h2>
        <p class="ml-4">
          当局は、本サービスや本サービスが提供するコンテンツに、システムバグや第三者の権利侵害が含まれないことを保証するものではありません。また、安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性を保証するものでもありません。
        </p>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第12条（免責）</h2>
        <p class="ml-4">
          当局は、本サービスに関してユーザーに生じたあらゆる損害について一切の責任を負いません。ただし、本サービスに関する当局とユーザーとの間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合、この免責規定は適用されません。
        </p>
        <p class="ml-4">
          消費者契約に該当する場合であっても、当局は、当局の過失（重過失を除きます。）によってユーザーに生じた損害のうち特別の事情から生じた損害（当局またはユーザーが損害発生につき予見し、または予見し得た場合を含みます。）について、一切の責任を負いません。ユーザーと他のユーザーまたは第三者との間において生じたトラブルについても一切責任を負いません。
        </p>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第13条（サービス内容の変更）</h2>
        <p class="ml-4">
          当局は、ユーザーに通知することなく、本サービスの内容を変更したり、本サービスの提供を中止、終了することができるものとします。当局は、これによってユーザーに生じた損害について一切の責任を負いません。
        </p>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第14条（利用規約の変更）</h2>
        <p class="ml-4">
          ユーザーは、管理者の書面による事前の承諾なく、利当局は、ユーザーに通知することなく、いつでも本規約を変更することができるものとします。変更後の本規約は、当局ウェブサイトに掲示された時点から効力を生じるものとします。本規約の変更後、本サービスの利用を継続したユーザーは、変更後の本規約に同意したものとみなします。用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し、または担保に供することはできません。
        </p>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第15条（個人情報の取扱い）</h2>
        <p class="ml-4">
          本サービスの利用によって取得するユーザーの個人情報については、当局のプライバシーポリシーに従い適切に取り扱うものとします。
        </p>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第16条（権利義務の譲渡）</h2>
        <p class="ml-4">
          ユーザーは、当局の書面による事前の承諾なく、利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し、または担保に供することはできません。
        </p>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第17条（適用関係）</h2>
        <p class="ml-4">
          本規約は、ユーザーと当局との間の本サービスの利用に関わる一切の関係に適用されるものとします。
        </p>
        <p class="ml-4">
          当局は本サービスに関し、本規約のほか、ご利用にあたってのルールを定めることがあります。これらのルールは、その名称のいかんに関わらず、本規約の一部を構成するものとします。本規約がこれらのルールと矛盾する場合には、これらのルールが優先して適用されるものとします。
        </p>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第18条（分離可能性）</h2>
        <p class="ml-4">
          本規約のいずれかの条項又はその一部が無効又は執行不能と判断された場合であっても、当該判断は他の部分に影響を及ぼさず、本規約の残りの部分は、引き続き有効かつ執行力を有するものとします。
        </p>
      </div>

      <div class="my-5">
        <h2 class="text-xl font-bold">第19条（準拠法・裁判管轄）</h2>
        <p class="ml-4">本規約の解釈にあたっては、日本法を準拠法とします。</p>
        <p class="ml-4">
          本サービスに関して紛争が生じた場合には、当局の本店所在地を管轄する地方裁判所を専属的合意管轄とします。
        </p>
      </div>

      <div class="my-5">
        <p class="p-0 text-right">以上</p>
        <p class="p-0">2022年04月25日 制定</p>
      </div>
    </section>
  </div>
</template>

<script>
export default {
  name: "Term",
};
</script>
